import re


def main():
    """
    6 or 7 で構成されるラッキーナンバー

    下一桁: 2,3,4(6+6,6+7,7+7)
    2: (3,4,5): (2,3,4) + 繰り上げ1
    3: (3,4,5): (2,3,4) + 繰り上げ1
    最上位:    (1)    :         繰り上げ1
           or (6,7,8): (6,7) + 繰り上げ(0/1)

      66| 666| 6666
    + 66|+ 66|+  66
    ----------------
     132| 732| 6732
    """
    p = input()
    if len(p) == 1 or p[-1] not in list("234"):
        print("No")
        return

    if p[0] == "1":
        # 同じ桁の足し算
        m = re.match("^1[3-5]*[2-4]$", p)
    else:
        # 桁ずれのところは必ず繰り上がるので6はない)
        # さらに桁ずれの部分では6 or 7
        m = re.match("^[6-7]*[7-8][3-5]*[2-4]$", p)
    if m:
        print("Yes")
    else:
        print("No")


if __name__ == '__main__':
    main()
